import React, { useState, useEffect } from "react";
import Modal from "./Modal";
import ButtonGrid from "./ButtonGrid";
import "../css/SearchSection.css";

const SearchSection = () => {

    const [selectedButton, setSelectedButton] = useState(null);

    // 모달 열고 닫기(비급여 진료비 항목 선택 부분)
    const openModal = (buttonId) => {
        setSelectedButton(buttonId);
    };

    const closeModal = () => {
        setSelectedButton(null);
    };

    //항목 조회 - 지역
    const [selectedCity, setSelectedCity] = useState(""); // 시/도 선택
    const [selectedDistrict, setSelectedDistrict] = useState(""); // 시/군/구 선택
    const [districts, setDistricts] = useState([]); // 시/군/구 목록
    const [towns, setTowns] = useState([]); // 읍/면/동 목록

    const cityDistrictMap = {
        서울 : {
            전체 : ["전체"],
            강남구 : ["전체", "개포동", "논현동", "대치동", "도곡동", "삼성동", "세곡동", "수서동", "신사동", "압구정동", "역삼동","율현동", "일원동", "자곡동", "청담동"],
            강동구 : ["전체", "강일동", "고덕동", "길동", "둔촌동", "명일동", "상일동", "성내동", "암사동", "천호동"],
            강북구 : ["전체", "미아동", "번동", "수유동", "우이동동"],
            강서구 : ["전체", "가야동", "개화동", "공항동", "과해동", "내발산동", "등촌동", "마곡동", "방화동", "염창동", "오곡동", "오쇠동", "외발산동", "화곡동"],
            관악구 : ["전체", "남현동", "봉천동", "신림동"],
            광진구 : ["전체", "광장동", "구의동", "군자동", "능동", "자양동", "중곡동", "화양동"],
            구로구 : ["전체", "가리봉동", "개봉동", "고척동", "구로동", "궁동", "신도림동", "오류동", "온수동", "천왕동", "항동"],
            금천구 : ["전체", "가산동", "독산동", "시흥동"],
            노원구 : ["전체", "공릉동", "상계동", "월계동", "중계동", "하계동"],
            도봉구 : ["전체", "도봉동", "방학동", "쌍문동", "창동"],
            동대문구 : ["전체", "답십리동", "신설동", "용두동", "이문동", "장안동", "전농동", "제기동", "청량리동", "회기동", "휘경동"],
            동작구 : ["전체", "노량진동", "대방동", "동작동", "본동", "사당동", "상도1동", "상도동", "신대방동", "흑석동"],
            마포구 : ["전체", "공덕동", "구수동", "노고산동", "당인동", "대흥동", "도화동", "동교동", "마포동", "망원동", "상수동", "상암동", "서교동", "성산동", "신공덕동", "신수동", "신정동", "아현동", "연남동", "염리동", "용강동", "중동", "창전동", "토정동", "하중동", "합정동", "현석동"],
            서대문구 : ["전체", "남가좌동", "냉천동", "대신동","대현동", "미근동", "봉원동", "북가좌동", "북아현동", "신촌동", "연희동", "영천동", "옥천동", "창천동", "천연동", "충정로2가", "충정로3가", "합동", "현저동", "홍은동", "홍제동"],
            서초구 : ["전체", "내곡동", "반포동", "방배동", "서초동", "신원동", "양재동", "염곡동", "우면동", "원지동", "잠원동"],
            성동구 : ["전체", "금호동1가", "금호동2가", "금호동3가", "금호동4가", "도선동", "마장동", "사근동", "상왕십리동", "성수동1가", "성수동2가", "송정동", "옥수동", "용답동", "응봉동", "하왕십리동", "행당동", "홍익동"],
            성북구 : ["전체", "길음동", "돈암동", "동선동1가", "동선동2가", "동선동3가", "동선동4가", "동선동5가", "동소문동1가", "동소문동2가", "동소문동3가", "동소문동4가", "동소문동5가", "동소문동6가", "동소문동7가", "보문동1가", "보문동2가", "보문동3가", "보문동4가", "보문동5가", "보문동6가", "보문동7가", "삼선동1가", "삼선동2가", "삼선동3가", "삼선동4가", "삼선동5가", "상월곡동", "석관동", "성북동", "성북동1가", "안암동1가", "안암동2가", "안암동3가", "안암동4가", "안암동5가","장위동", "정릉동", "종암동", "하월곡동"],
            송파구 : ["전체", "가락동", "거여동", "마천동", "문정동", "방이동", "삼전동", "석촌동", "송파동", "신천동", "오금동", "잠실동", "장지동", "풍납동"],
            양천구 : ["전체", "목동", "신월동", "신정동"],
            영등포구 : ["전체", "당산동", "당산동1가", "당산동2가", "당산동3가", "당산동4가", "당산동5가", "당산동6가", "대림동", "도림동", "문래동1가", "문래동2가", "문래동3가", "문래동4가", "문래동5가", "문래동6가", "신길동", "양평동", "양평동1가", "양평동2가", "양평동3가", "양평동4가", "양평동5가", "양평동6가", "양화동", "여의도동", "영등포동", "영등포동1가", "영등포동2가", "영등포동3가", "영등포동4가", "영등포동5가", "영등포동6가", "영등포동7가", "영등포동8가"],
            용산구 : ["전체", "갈월동", "남영동", "도원동", "동빙고동", "동자동", "문배동", "보광동", "산천동", "서계동", "서빙고동", "신계동", "신창동","용문동", "용산동1가", "용산동2가", "용산동3가", "용산동4가", "용산동5가", "용산동6가", "원효로1가", "원효로2가", "원효로3가", "원효로4가", "이촌동", "이태원동", "주성동", "청암동", "청파동1가", "청파동2가", "청파동3가", "한강로1가", "한강로2가", "한강로3가", "한남동", "효창동", "후암동"],
            은평구 : ["전체", "갈현동", "구산동", "녹번동", "대조동", "불광동", "수색동", "신사동", "역촌동", "응암동", "증산동", "진관동"],
            종로구 : ["전체", "가회동", "견지동", "계동", "공평동", "관수동", "관철동", "관훈동", "교남동", "교북동", "구기동", "궁정동", "권농동", "낙원동", "내수동", "내자동", "누상동", "누하동", "당주동", "도렴동", "돈의동", "동숭동","명륜1가", "명륜2가", "명륜3가", "명륜4가", "묘동", "무악동", "봉익동", "부암동", "사간동", "사직동", "삼청동", "서린동", "세종로", "소격동", "송월동", "송현동", "수송동", "숭인동", "신교동", "신문로1가", "신문로2가", "신영동", "안국동", "연건동", "연지동", "예지동", "옥인동", "와룡동", "운니동", "원남동", "원서동", "이화동", "익선동", "인사동", "인의동", "장사동", "재동", "적선동", "종로1가", "종로2가", "종로3가", "종로4가", "종로5가", "종로6가", "중학동", "창성동", "창신동", "청운동", "청진동", "체부동", "충신동", "통의동", "통인동", "팔판동", "평동", "평창동", "필운동", "행촌동", "혜화동", "홍지동", "홍파동", "화동", "효자동", "효제동", "훈정동"],
            중구 : ["전체", "광희동1가", "광희동2가", "남대문로1가", "남대문로2가", "남대문로3가", "남대문로4가", "남대문로5가", "남산동1가", "남산동2가", "남산동3가", "남창동", "다동", "만리동1가", "만리동2가", "명동1가", "명동2가", "무교동", "무학동", "묵정동", "방산동", "봉래동1가", "봉래동2가", "북창동", "산림동", "삼각동", "서소문동", "소공동", "수표동", "수하동", "순화동", "신당동", "쌍림동", "예관동", "예장동", "오장동", "을지로1가", "을지로2가", "을지로3가", "을지로4가", "을지로5가", "을지로6가", "을지로7가", "의주로1가","의주로2가", "인현동1가", "인현동2가", "입정동", "장교동", "장충동1가", "장충동2가", "저동1가", "저동2가", "정동", "주교동", "주자동", "중림동", "초동", "충무로1가", "충무로2가", "충무로3가", "충무로4가", "충무로5가", "충정로1가", "태평로1가", "태평로2가", "필동1가", "필동2가", "필동3가", "황학동", "회현동1가", "회현동2가", "회현동3가", "흥인동"],
            중랑구 : ["전체", "망우동", "면목동", "묵동", "상봉동", "신내동", "중화동"],
        },
        부산 : {
            전체 : ["전체"],
            부산강서구 : ["전체", "강동동", "구랑동", "녹산동", "눌차동", "대저1동", "대저2동", "대항동", "동선동", "명지동", "미음동", "범방동", "봉림동", "생곡동", "성북동", "송정동", "식만동", "신호동", "죽동동", "죽림동", "지사동", "천성동", "화전동"],
            부산금정구 : ["전체", "구서동", "금사동", "금성동", "남산동", "노포동", "두구동", "부곡동", "서동", "선동", "오륜동", "장전동", "청룡동", "회동동동"],
            부산기장군 : ["전체", "기장읍", "일광면", "일광읍", "장안읍", "정관읍", "철마면"],
            부산남구 : ["전체", "감만동", "대연동", "문현동", "용당동", "용호동", "우암동"],
            부산동구 : ["전체", "범일동", "수정동", "좌천동", "초량동"],
            부산동래구 : ["전체", "낙민동", "명륜동", "명장동", "복천동", "사직동", "수안동", "안락동", "온천동", "칠산동"],
            부산북구 : ["전체", "구포동", "금곡동", "덕천동", "만덕동", "화명동"],
            부산사상구 : ["전체", "감전동", "괘법동", "덕포동", "모라동", "삼락동", "엄궁동", "주례동", "학장동"],
            부산사하구 : ["전체", "감천동", "괴정동", "구평동", "다대동", "당리동", "신평동", "장림동", "하단동"],
            부산서구 : ["전체", "남부민동", "동대신동1가", "동대신동2가", "동대신동3가", "부민동1가", "부민동2가", "부민동3가", "부용동1가", "부용동2가", "서대신동1가", "서대신동2가", "서대신동3가", "아미동1가", "아미동2가", "암남동", "초장동", "충무동1가", "충무동2가", "충무동3가", "토성동1가", "토성동2가", "토성동3가", "토성동4가", "토성동5가"],
            부산수영구 : ["전체", "광안동", "남천동", "망미동", "민락동", "수영동"],
            부산연제구 : ["전체", "거제동", "연산동"],
            부산영도구 : ["전체", "남항동1가", "남항동2가", "남항동3가", "대교동1가", "대교동2가", "대평동1가", "대평동2가", "동삼동", "봉래동1가", "봉래동2가", "봉래동3가", "봉래동4가", "봉래동5가", "신선동1가", "신선동2가", "신선동3가", "영선동1가", "영선동2가", "영선동3가", "영선동4가" ,"청학동"],
            부산중구 : ["전체", "광복동1가", "광복동2가", "광복동3가", "남포동1가", "남포동2가", "남포동3가", "남포동4가", "남포동5가", "남포동6가", "대창동1가", "대창동2가", "대청동1가", "대청동2가", "대청동3가", "대청동4가", "동광동1가", "동광동2가", "동광동3가", "동광동4가", "동광동5가", "보수동1가", "보수동2가", "보수동3가", "부평동1가", "부평동2가", "부평동3가", "부평동4가", "신창동1가", "신창동2가", "신창동3가", "신창동4가", "영주동", "중앙동1가", "중앙동2가", "중앙동3가", "중앙동4가", "중앙동5가", "중앙동6가", "중앙동7가", "창선동1가", "창선동2가"],
            부산진구 : ["전체", "가야동", "개금동", "당감동", "범전동", "범천동", "부암동", "부전동", "양정동", "연지동", "전포동", "초읍동"],
            부산해운대구 : ["전체", "반송동", "반여동", "석대동", "송정동", "우동", "재송동", "좌동", "중동"],
        },
        인천 : {
            전체 : ["전체"],
            인천강화군 : ["전체", "강화읍", "교동면", "길상면", "내가면", "불은면", "삼산면", "서도면", "선원면", "송해면", "양도면", "양사면", "하점면", "화도면면"], 
            인천계양구 : ["전체", "갈현동", "계산동", "귤현동", "노오지동", "다남동", "동양동", "둑실동", "목상동", "박촌동", "방축동", "병방동", "상야동", "서운동", "선주지동", "오류동", "용종동", "이화동", "임학동", "작전동", "장기동", "평동", "하야동", "효성동"],
            인천남동구 : ["전체", "간석동", "고잔동", "구월동", "남촌동", "논현동", "도림동", "만수동", "서창동", "수산동", "운연동", "장수동"],
            인천동구 : ["전체", "금곡동", "만석동", "송림동", "송현동", "창영동", "화수동", "화평동"],
            인천미추홀구 : ["전체", "관교동", "도화동", "문학동", "숭의동", "용현동", "주안동", "학익동"],
            인천부평구 : ["전체", "갈산동", "구산동", "부개동", "부평동", "산곡동", "삼산동", "십정동", "일신동", "청천동"],
            인천서구 : ["전체", "가정동", "가좌동", "검암동", "경서동", "공촌동", "금곡동", "당하동", "대곡동", "마전동", "백석동", "불로동", "석남동", "시천동", "신현동", "심곡동", "연희동", "오류동", "왕길동", "원당동", "원창동", "청라동"],
            인천연수구 : ["전체", "동춘동", "선학동", "송도동", "연수동", "옥련동", "청학동"],
            인천옹진군 : ["전체", "대청면", "덕적면", "백령면", "북도면", "연평면", "영흥면", "자월면"],
            인천중구 : ["전체", "경동", "관동1가", "관동2가", "관동3가", "남북동", "내동", "답동", "덕교동", "도원동", "무의동", "북성동1가", "북성동2가", "북성동3가", "사동", "선린동", "선화동", "송월동1가", "송월동2가", "송월동3가", "송학동1가", "송학동2가", "송학동3가", "신생동", "신포동", "신흥동1가", "신흥동2가", "신흥동3가", "용동", "운남동", "운북동", "운서동", "유동", "율목동", "을왕동", "인현동", "전동", "중산동", "중앙동1가", "중앙동2가", "중앙동3가", "중앙동4가", "항동1가", "항동2가", "항동3가", "항동4가", "항동5가", "항동6가", "항동7가", "해안동1가", "해안동2가", "해안동3가", "해안동4가"],  
        },
        대구 : {
            전체 : ["전체"],
            대구군위군 : ["전체", "군위읍", "부계면", "산성면", "삼국유사면", "소보면", "우보면", "의흥면", "효령면"],
            대구남구 : ["전체", "대명동", "봉덕동", "이천동"],
            대구달서구 : ["전체", "갈산동", "감삼동", "대곡동", "대천동", "도원동", "두류동", "본동", "본리동", "상인동", "성당동", "송현동", "신당동", "용산동", "월성동", "월암동", "유천동", "이곡동" ,"장기동", "장동", "죽전동", "진천동", "파호동", "호림동", "호산동"],
            대구달성군: ["전체", "가창면", "구지면", "논공읍", "다사읍", "옥포면", "옥포읍", "유가면", "유가읍", "하빈면", "현풍면", "현풍읍", "화원읍"],
            대구동구 : ["전체", "각산동", "검사동", "괴전동", "금강동", "내곡동", "내동", "능성동", "대림동", "덕곡동", "도동" ,"도학동", "동내동", "동호동", "둔산동", "매여동", "미곡동", "미대동", "방촌동", "백안동", "봉무동", "부동", "불로동", "사복동", "상매동", "서호동", "송정동", "숙천동", "신기동", "신무동", "신서동", "신암동", "신용동", "신천동", "신평동", "용계동", "용수동", "율암동", "율하동", "입석동", "중대동", "지묘동", "지저동", "진인동", "평광동", "효목동"],
            대구북구 : ["전체", "검단동", "고성동1가", "고성동2가", "고성동3가", "관음동", "구암동", "국우동", "금호동", "노곡동", "노원동1가", "노원동2가", "노원동3가", "대현동", "도남동", "동변동", "동천동", "동호동", "매천동", "복현동", "사수동", "산격동", "서변동", "연경동", "읍내동", "조야동", "칠성동1가", "칠성동2가", "침산동", "태전동", "팔달동", "학정동"],
            대구서구 : ["전체", "내당동", "비산동", "상리동", "원대동1가", "원대동2가", "원대동3가", "이현동", "중리동", "평리동"],
            대구수성구 : ["전체", "가천동", "고모동", "노변동", "대흥동", "두산동", "만촌동", "매호동", "범물동", "범어동", "사월동", "삼덕동", "상동", "성동", "수성동1가", "수성동2가", "수성동3가", "수성동4가", "시지동", "신매동", "연호동", "욱수동", "이천동", "중동", "지산동", "파동", "황금동"],
            대구중구 : ["전체", "계산동1가", "계산동2가", "공평동", "교동", "남산동", "남성로", "남일동", "달성동", "대봉동", "대신동", "대안동", "덕산동", "도원동", "동문동", "동산동", "동성로1가", "동성로2가", "동성로3가", "동인동1가", "동인동2가", "동인동3가", "동인동4가", "동일동", "문화동", "봉산동", "북내동", "북성로1가", "북성로2가", "사일동", "삼덕동1가", "삼덕동2가", "삼덕동3가", "상덕동", "상서동", "서내동", "서문로1가", "서문로2가", "서성로1가", "서성로2가", "서야동", "수동", "수창동", "시장북로", "완전동", "용덕동", "인교동", "장관동", "전동", "종로1가", "종로2가", "태평로1가", "태평로2가", "태평로3가", "포정동", "하서동", "향촌동", "화전동"],
        },
        광주 : {
            전체 : ["전체"],
            광주광산구 : ["전체", "고룡동", "광산동", "남산동", "내산동", "대산동", "덕림동", "도덕동", "도산동", "도천동", "도호동", "동림동", "동산동", "동호동", "두정동", "등임동", "명도동", "명화동", "박호동", "복룡동", "본덕동", "북산동", "비아동", "사호동", "산막동", "산수동" ,"산월동", "산정동", "삼거동", "삼도동", "서봉동", "선동", "선암동", "소촌동", "송대동", "송산동", "송정동", "송촌동", "송치동", "송학동", "수완동", "신가동", "신동", "신룡동", "신창동", "신촌동", "쌍암동", "안청동", "양동", "양산동", "연산동", "오산동", "오선동", "오운동", "옥동", "왕동", "요기동", "용곡동", "용동", "용봉동", "우산동", "운남동", "운수동", "월계동", "월곡동", "월전동", "유계동", "임곡동", "장덕동", "장록동", "장수동", "지산동", "지정동", "지죽동", "지평동", "진곡동", "하남동", "하산동", "황룡동", "흑석동"],
            광주남구 : ["전체", "구동", "구소동", "노대동", "대지동", "덕남동", "도금동", "방림동", "백운동", "봉선동", "사동", "서동", "석정동", "송하동", "승촌동", "신장동", "압촌동", "양과동", "양림동", "양촌동", "원산동", "월산동", "월성동", "이장동", "임암동", "주월동", "지석동", "진월동", "칠석동", "행암동", "화장동"],
            광주동구 : ["전체", "계림동", "광산동", "궁동", "금남로1가", "금남로2가", "금남로3가", "금남로4가", "금남로5가", "금동", "남동", "내남동", "대의동", "대인동", "동명동", "불로동", "산수동", "서석동", "선교동", "소태동", "수기동", "용산동", "용연동", "운림동", "월남동", "장동", "지산동", "충장로1가", "충장로2가", "충장로3가", "충장로4가", "충장로5가", "학동", "호남동", "황금동"],
            광주북구 : ["전체", "각화동", "금곡동", "누문동", "대촌동", "덕의동", "동림동", "두암동", "망월동", "매곡동", "문흥동", "본촌동", "북동", "삼각동", "생용동", "수곡동", "신안동", "신용동", "양산동", "연제동", "오룡동", "오치동", "용강동", "용두동", "용봉동", "용전동", "우산동", "운암동", "운정동", "월출동", "유동", "일곡동", "임동", "장등동", "중흥동", "지야동", "청풍동", "충효동", "태령동", "풍향동", "화암동", "효령동"],
            광주서구 : ["전체", "광천동", "금호동", "내방동", "농성동", "덕흥동", "동천동", "마륵동", "매월동", "벽진동", "서창동", "세하동", "쌍촌동", "양동", "용두동", "유촌동", "치평동", "풍암동", "화정동"],
        },
        대전 : {
            전체 : ["전체"],
            대전대덕구 : ["전체", "갈전동", "대화동", "덕암동", "목상동", "문평동", "미호동", "법동", "비래동", "삼정동", "상서동", "석봉동", "송촌동", "신대동", "신일동", "신탄진동", "연축동", "오정동", "와동", "용호동", "읍내동", "이현동", "장동", "중리동", "평촌동"],
            대전동구 : ["전체", "가양동", "가오동", "구도동", "낭월동", "내탑동", "대동", "대별동", "대성동", "마산동", "비룡동", "사성동", "삼괴동", "삼성동", "삼정동", "상소동", "성남동", "세천동", "소제동", "소호동", "신상동", "신안동", "신촌동", "신하동", "신흥동", "오동", "용운동", "용전동", "원동", "이사동", "인동", "자양동", "장척동", "정동", "주산동", "주촌동", "중동", "직동", "천동", "추동", "판암동", "하소동", "홍도동", "효동", "효평동"],
            대전서구 : ["전체", "가수원동", "가장동", "갈마동", "관저동", "괴곡동", "괴정동", "내동", "도마동", "도안동", "둔산동", "만년동", "매노동", "변동", "복수동", "봉곡동", "산직동", "오동", "용문동", "용촌동", "우명동", "원정동", "월평동", "장안동", "정림동", "탄방동", "평촌동", "흑석동"],
            대전유성구 : ["전체", "가정동", "갑동", "계산동", "관평동", "교촌동", "구룡동", "구성동", "구암동", "궁동", "금고동", "금탄동", "노은동", "대동", "대정동", "덕명동", "덕진동", "도룡동", "둔곡동", "문지동", "반석동", "방동", "방현동", "복용동", "봉명동", "봉산동", "상대동", "성북동", "세동", "송강동", "송정동", "수남동", "신동", "신봉동", "신성동", "안산동", "어은동", "외삼동", "용계동", "용산동", "원내동", "원신흥동", "원촌동", "자운동", "장대동", "장동", "전민동", "죽동", "지족동", "추목동", "탑립동", "하기동", "학하동", "화암동"],
            대전중구 : ["전체", "구완동", "금동", "대사동", "대흥동", "목달동", "목동", "무수동", "문창동", "문화동", "부사동", "사정동" ,"산성동", "석교동", "선화동", "안영동", "어남동", "오류동", "옥계동", "용두동", "유천동", "은행동", "정생동", "중촌동", "침산동", "태평동", "호동"],
        },
        울산 : {
            전체 : ["전체"],
            울산남구 : ["전체", "고사동", "남화동", "달동", "두왕동", "매암동", "무거동", "부곡동", "삼산동", "상개동", "선암동", "성암동", "신정동", "야음동", "여천동", "옥동", "용연동", "용잠동", "장생포동", "황성동"], 
            울산동구 : ["전체", "동부동", "미포동", "방어동", "서부동", "일산동", "전하동", "주전동", "화정동"],
            울산북구 : ["전체", "가대동", "구유동", "달천동", "당사동", "대안동", "매곡동", "명촌동", "무룡동", "산하동", "상안동", "송정동", "시례동", "신명동", "신천동", "신현동", "양정동", "어물동", "연암동", "염포동", "정자동", "중산동", "진장동", "창평동", "천곡동", "호계동", "화봉동", "효문동"],
            울산울주군 : ["전체", "두동면", "두서면", "범서읍", "삼남면", "삼남읍", "삼동면", "상북면", "서생면", "언양읍", "온산읍", "온양읍", "웅촌면", "청량면", "청량읍"],
            울산중구 : ["전체", "교동", "남외동", "다운동", "동동", "반구동", "복산동", "북정동", "서동", "성남동", "성안동", "약사동", "옥교동", "우정동", "유곡동", "장현동", "태화동", "학산동", "학성동"],
        },
        경기 : {
            전체 : ["전체"],
            가평군 : ["전체", "가평읍", "북면", "상면", "설악면", "조종면", "청평면", "하면"],
            고양덕양구 : ["전체", "강매동", "고양동", "관산동", "내곡동", "내유동", "대자동", "대장동", "덕은동", "도내동", "동산동", "벽제동", "북한동", "삼송동", "선유동", "성사동", "신원동", "신평동", "오금동", "용두동", "원당동", "원흥동", "주교동", "지축동", "토당동", "행신동", "행주내동", "행주외동", "향동동", "현천동", "화전동", "화정동", "효자동"],
            고양일산동구 : ["전체", "마두동", "문봉동" ,"백석동", "사리현동", "산황동", "설문동", "성석동", "식사동", "장항동", "정발산동", "중산동", "지영동" ,"풍동"],
            고양일산서구 : ["전체", "가좌동", "구산동", "대화동", "덕이동", "법곳동", "일산동", "주엽동", "탄현동"],
            과천시 : ["전체", "갈현동", "과천동", "관문동", "막계동", "문원동", "별양동", "부림동", "원문동", "주암동", "중앙동"],
            광명시 : ["전체", "가학동", "광명동", "노온사동", "소하동", "옥길동", "일직동", "철산동", "하안동"],
            광주시 : ["전체", "경안동", "고산동", "곤지암읍", "남종면", "남한산성면", "능평동", "도척면", "매산동", "목동", "목현동", "문형동", "삼동", "송정동", "신현동", "쌍령동", "양벌동", "역동", "오포읍", "장지동", "중대동", "중부면", "직동", "초월읍", "추자동", "탄벌동", "태전동", "퇴촌면", "회덕동"],
            구리시 : ["전체", "갈매동", "교문동", "사노동", "수택동", "아천동", "인창동", "토평동"],
            군포시 : ["전체", "금정동", "당동", "당정동", "대야미동", "도마교동", "둔대동", "부곡동", "산본동", "속달동"],
            김포시 : ["전체", "감정동", "걸포동", "고촌읍", "구래동", "대곶면", "마산동", "북변동", "사우동", "양촌읍", "운양동", "월곶면", "장기동", "통진읍", "풍무동", "하성면"],
            남양주시 : ["전체", "가운동", "금곡동", "다산동", "도농동", "별내동", "별내면", "삼패동", "수동면", "수석동", "오남읍", "와부읍", "이패동", "일패동", "조안면", "지금동", "진건읍", "진접읍", "퇴계원면", "퇴계원읍", "평내동", "호평동", "화도읍"],
            동두천시 : ["전체", "걸산동", "광암동", "동두천동", "보산동", "상봉암동", "상패동", "생연동", "송내동", "안흥동", "지행동", "탑동동", "하봉암동"],
            부천소사구 : ["전체", "계수동", "괴안동", "범박동", "소사본동", "송내동", "심곡본동", "옥길동"],
            부천오정구 : ["전체", "고강동", "내동", "대장동", "삼정동", "여월동", "오정동", "원종동", "작동"],
            부천원미구 : ["전체", "도당동", "상동", "소사동", "심곡동", "약대동", "역곡동", "원미동", "중동", "춘의동"],
            성남분당구 : ["전체", "구미동", "궁내동", "금곡동", "대장동", "동원동", "백현동", "분당동", "삼평동", "서현동", "석운동", "수내동", "야탑동", "운중동", "율동", "이매동", "정자동", "판교동", "하산운동"],
            성남수정구 : ["전체", "고등동", "금토동", "단대동", "둔전동", "복정동", "사송동", "산성동", "상적동", "수진동", "시흥동", "신촌동", "신흥동", "심곡동", "양지동", "오야동", "창곡동", "태평동"],
            성남중원구 : ["전체", "갈현동", "금광동", "도촌동", "상대원동", "성남동", "여수동", "은행동", "중앙동", "하대원동"],
            수원권선구 : ["전체", "고색동", "곡반정동", "구운동", "권선동", "금곡동", "당수동", "대황교동", "서둔동", "세류동", "오목천동", "입북동", "장지동", "탑동", "평동", "평리동", "호매실동"],
            수원영통구 : ["전체", "망포동", "매탄동", "신동", "영통동", "원천동", "이의동", "하동"],
            수원장안구 : ["전체", "상광교동", "송죽동", "연무동", "영화동", "율전동", "이목동", "정자동", "조원동", "천천동", "파장동", "하광교동"],
            수원팔달구 : ["전체", "고등동", "교동", "구천동", "남수동", "남창동", "매교동", "매산로1가", "매산로2가", "매산로3가", "매향동", "북수동", "신풍동", "영동", "우만동", "인계동", "장안동", "중동", "지동", "팔달로1가", "팔달로2가", "팔달로3가", "화서동"],
            시흥시 : ["전체", "거모동", "계수동", "과림동", "광석동", "군자동", "금이동", "논곡동", "능곡동", "대야동", "도창동", "매화동", "목감동", "무지내동", "물왕동", "미산동", "방산동", "배곧동", "산현동", "신천동", "안현동", "월곶동", "은행동", "장곡동", "장현동", "정왕동", "조남동", "죽율동", "포동", "하상동", "하중동", "화정동"],
            안산단원구 : ["전체", "고잔동", "대부남동", "대부동동", "대부북동", "목내동", "선감동", "선부동", "성곡동", "신길동", "와동", "원곡동", "원시동", "초지동", "풍도동", "화정동"],
            안산상록구 : ["전체", "건건동", "본오동", "부곡동", "사동", "사사동", "성포동", "수암동", "양상동", "월피동", "이동", "일동", "장상동", "장하동", "팔곡이동", "팔곡일동"],
            안성시 : ["전체", "가사동", "가현동", "계동", "고삼면", "공도읍", "구포동", "금광면", "금산동", "금석동", "낙원동", "당왕동", "대덕면", "대천동", "도기동", "동본동", "명륜동", "미양면", "발화동", "보개면", "봉남동", "봉산동", "사곡동", "삼죽면", "서운면", "서인동", "석정동", "성남동", "숭인동", "신건지동", "신모산동", "신소현동", "신흥동", "아양동", "양성면", "연지동", "영동", "옥산동", "옥천동", "원곡면", "인지동", "일죽면", "죽산면", "중리동", "창전동", "현수동"],
            안양동안구 : ["전체", "관양동", "비산동", "평촌동", "호계동"],
            안양만안구 : ["전체", "박달동", "석수동", "안양동"],
            양주시 : ["전체", "고암동", "고읍동", "광사동", "광적면", "남면", "남방동", "덕계동", "덕정동", "마전동", "만송동", "백석읍", "봉양동", "산북동", "삼숭동", "어둔동", "옥정동", "유양동", "율정동", "은현면", "장흥면", "회암동", "회정동"],
            양평군 : ["전체", "강상면", "강하면", "개군면", "단월면", "서종면", "양동면", "양서면", "양평읍", "옥천면", "용문면", "지평면", "청운면"],
            여주시 : ["전체", "가남읍", "가업동", "강천면", "교동", "금사면", "능서면", "능현동", "단현동", "대신면", "매룡동", "멱곡동", "북내면", "산북면", "삼교동", "상거동", "상동", "세종대왕면", "신진동", "연라동", "연양동", "오금동", "오학동", "우만동", "월송동", "점동면", "점봉동", "창동" ,"천송동", "하거동", "하동", "현암동", "홍문동", "흥천면"],
            연천군 : ["전체", "군남면", "미산면", "백학면", "신서면", "연천읍", "왕징면", "장남면", "전곡읍", "중면", "청산면"],
            오산시 : ["전체", "가수동", "가장동", "갈곶동", "고현동", "궐동", "금암동", "내삼미동", "누읍동", "두곡동", "벌음동", "부산동", "서동", "서랑동", "세교동", "수청동", "양산동", "오산동", "외삼미동", "원동", "은계동", "지곶동", "청학동", "청호동", "탑동"],
            용인기흥구 : ["전체", "고매동", "공세동", "구갈동", "농서동", "동백동", "마북동", "보라동", "보정동", "상갈동", "상하동", "서천동", "신갈동", "언남동", "양덕동", "중동", "지곡동", "청덕동", "하갈동"],
            용인수지구 : ["전체", "고기동", "동천동", "상현동", "성복동", "신봉동", "죽전동", "풍덕천동"],
            용인처인구 : ["전체", "고림동", "김량장동", "남동", "남사면", "남사읍", "마평동", "모현면", "모현읍", "백암면", "삼가동", "양지면", "역북동", "운학동", "원삼면", "유방동", "이동면", "이동읍", "포곡읍", "해곡동", "호동"],
            의왕시 : ["전체"],
            의정부시 : ["전체"],
            이천시 : ["전체"],
            파주시 : ["전체"],
            평택시 : ["전체"],
            포천시 : ["전체", ],
            하남시 : ["전체", ],
            화성시 : ["전체", ],
        },
        강원 : {
            전체 : ["전체"],
            강릉시 : ["전체", ],
            고성군 : ["전체", ],
            동해시 : ["전체", ],
            삼척시 : ["전체", ],
            속초시 : ["전체", ],
            양구군 : ["전체", ],
            양양군 : ["전체", ],
            영월군 : ["전체", ],
            원주시 : ["전체", ],
            인제군 : ["전체", ],
            정선군 : ["전체", ],
            철원군 : ["전체", ],
            춘천시 : ["전체", ],
            태백시 : ["전체", ],
            평창군 : ["전체", ],
            홍천군 : ["전체", ],
            화천군 : ["전체", ],
            횡성군 : ["전체", ],
        },
        충북 : {
            전체 : ["전체"],
            괴산군 : ["전체", ],
            단양군 : ["전체", ],
            보은군 : ["전체", ],
            영동군 : ["전체", ],
            옥천군 : ["전체", ],
            음성군 : ["전체", ],
            제천시 : ["전체", ],
            증평군 : ["전체", ],
            진천군 : ["전체", ],
            청주상당구 : ["전체", ],
            청주서원구 : ["전체", ],
            청주청원구 : ["전체", ],
            청주흥덕구 : ["전체", ],
            충주시 : ["전체", ],
        },
        충남 : {
            전체 : ["전체"],
            계룡시 : ["전체", ],
            공주시 : ["전체", ],
            금산군 : ["전체", ],
            논산시 : ["전체", ],
            당진시 : ["전체", ],
            보령시 : ["전체", ],
            부여군 : ["전체", ],
            서산시 : ["전체", ],
            서천군 : ["전체", ],
            아산시 : ["전체", ],
            예산군 : ["전체", ],
            천안동남구 : ["전체", ],
            천안서북구 : ["전체", ],
            청양군 : ["전체", ],
            태안군 : ["전체", ],
            홍성군 : ["전체", ],
        },
        전북 : {
            전체 : ["전체"],
            고창군 : ["전체", ],
            군산시 : ["전체", ],
            김제시 : ["전체", ],
            남원시 : ["전체", ],
            무주군 : ["전체", ],
            부안군 : ["전체", ],
            순창군 : ["전체", ],
            완주군 : ["전체", ],
            익산시 : ["전체", ],
            임실군 : ["전체", ],
            장수군 : ["전체", ],
            전주덕진구 : ["전체", ],
            전주완산구 : ["전체", ],
            정읍시 : ["전체", ],
            진안군 : ["전체", ],
        },
        전남 : {
            전체 : ["전체"],
            강진군 : ["전체", ],
            고흥군 : ["전체", ],
            곡성군 : ["전체", ],
            광양시 : ["전체", ],
            구례군 : ["전체", ],
            나주시 : ["전체", ],
            담양군 : ["전체", ],
            목포시 : ["전체", ],
            무안군 : ["전체", ],
            보성군 : ["전체", ],
            순천시 : ["전체", ],
            신안군 : ["전체", ],
            여수시 : ["전체", ],
            영광군 : ["전체", ],
            영암군 : ["전체", ],
            완도군 : ["전체", ],
            장성군 : ["전체", ],
            장흥군 : ["전체", ],
            진도군 : ["전체", ],
            함평군 : ["전체", ],
            해남군 : ["전체", ],
            화순군 : ["전체", ],
        },
        경북 : {
            전체 : ["전체"],
            경산시 : ["전체", ],
            경주시 : ["전체", ],
            고령군 : ["전체", ],
            구미시 : ["전체", ],
            김천시 : ["전체", ],
            문경시 : ["전체", ],
            봉화군 : ["전체", ],
            상주시 : ["전체", ],
            성주군 : ["전체", ],
            안동시 : ["전체", ],
            영덕군 : ["전체", ],
            영양군 : ["전체", ],
            영주시 : ["전체", ],
            영천시 : ["전체", ],
            예천군 : ["전체", ],
            울릉군 : ["전체", ],
            울진군 : ["전체", ],
            의성군 : ["전체", ],
            청도군 : ["전체", ],
            청송군 : ["전체", ],
            칠곡군 : ["전체", ],
            포항남구 : ["전체", ],
            포항북구 : ["전체", ],
        },
        경남 : {
            전체 : ["전체"],
            거제시 : ["전체", ],
            거창군 : ["전체", ],
            고성군 : ["전체", ],
            김해시 : ["전체", ],
            남해군 : ["전체", ],
            밀양시 : ["전체", ],
            사천시 : ["전체", ],
            산청군 : ["전체", ],
            양산시 : ["전체", ],
            의령군 : ["전체", ],
            진주시 : ["전체", ],
            창녕군 : ["전체", ],
            창원마산합포구 : ["전체", ],
            창원마산회원구 : ["전체", ],
            창원성산구 : ["전체", ],
            창원의창구 : ["전체", ],
            창원진해구 : ["전체", ],
            통영시 : ["전체", ],
            하동군 : ["전체", ],
            함안군 : ["전체", ],
            함양군 : ["전체", ],
            합천군 : ["전체", ],
        },
        제주 : {
            전체 : ["전체"],
            서귀포시 : ["전체", ],
            제주시 : ["전체", ],
        },
        세종 : {
            전체 : ["전체"],
            세종시 : ["전체", ],
        }
    }

    // 시/도 변경 핸들러
    const handleCityChange = (e) => {
        const city = e.target.value;
        setSelectedCity(city);
        setSelectedDistrict(""); // 시/군/구 초기화
        setTowns([]); // 읍/면/동 초기화
        setDistricts(cityDistrictMap[city] ? Object.keys(cityDistrictMap[city]) : []); // 해당 시/도의 시/군/구 가져오기
    };

    // 시/군/구 변경 핸들러
    const handleDistrictChange = (e) => {
        const district = e.target.value;
        setSelectedDistrict(district);
        setTowns(cityDistrictMap[selectedCity]?.[district] || []); // 해당 시/군/구의 읍/면/동 가져오기
    };

    return (
        <section className="search-section">
            <div className="navbar">
                <h2>비급여 진료비용 상세 검색</h2>
            </div>

            {/* 병·의원으로 조회하기 */}
            <div className="search-item">
                <label>병·의원으로 조회하기</label>
                <div className="input-with-icon">
                    <input
                        type="text"
                        placeholder="병·의원 이름 또는 도로명 주소 입력"
                    />
                    <img src={require("../icon/search.png")} alt="Search" className="icon-search" />
                </div>
            </div>

            {/* 항목으로 조회하기기 */}
            <div className="search-item">
                <h3>1. 지역</h3>
                {/* 시/도 선택 */}
            <select value={selectedCity} onChange={handleCityChange}>
                <option value="" disabled hidden>
                    시/도 선택
                </option>
                {Object.keys(cityDistrictMap).map((city) => (
                    <option key={city} value={city}>
                        {city}
                    </option>
                ))}
            </select>

            {/* 시/군/구 선택 */}
            <select
                value={selectedDistrict}
                onChange={handleDistrictChange}
                disabled={!selectedCity}
            >
                <option value="" disabled hidden>
                    {selectedCity ? "시/군/구 선택" : "먼저 시/도를 선택하세요"}
                </option>
                {districts.map((district) => (
                    <option key={district} value={district}>
                        {district}
                    </option>
                ))}
            </select>

            {/* 읍/면/동 선택 */}
            <select disabled={!selectedDistrict}>
                <option value="" disabled hidden>
                    {selectedDistrict ? "읍/면/동 선택" : "먼저 시/군/구를 선택하세요"}
                </option>
                {towns.map((town) => (
                    <option key={town} value={town}>
                        {town}
                    </option>
                ))}
            </select>
            </div>

            <div className="search-item">
                <h3>2. 의료기관 규모</h3>
                <select>
                    <option>전체</option>
                    <option>상급종합병원</option>
                    <option>종합병원</option>
                    <option>병원</option>
                    <option>요양병원</option>
                    <option>정신병원</option>
                    <option>치과병원</option>
                    <option>한방병원</option>
                    <option>의원</option>
                    <option>치과의원</option>
                    <option>한의원</option>
                </select>
            </div>

            <div className="search-item">
                <h3>3. 비급여 진료비 항목</h3>
                <div className="input-with-icon">
                    <input type="text" placeholder="비급여진료비 항목명 또는 병명으로 검색 가능 예시)독감" />
                    <img src={require("../icon/search.png")} alt="Search" className="icon-search" />
                </div>
                {/* 버튼 그리드 */}
                <div className="button-grid-container">
                    <ButtonGrid onButtonClick={openModal} />
                </div>

                {/* 모달 */}
                {selectedButton !== null && (
                    <Modal buttonId={selectedButton} onClose={closeModal} />
                )}
            </div>

            
        </section>
    );
};

export default SearchSection;
